In [63]:
import pandas as pd
s=pd.read_csv(r"C:\Users\mouni\Downloads\weather_data.csv")
s

         Date          City  Temperature_C  Humidity_% Condition
0  01-01-2025      Hyderbad             28          60     Sunny
1  02-01-2025    Vijayawada             29          62     Sunny
2  03-01-2025  Viskhapatnam             30          58    Cloudy
3  04-01-2025      Kakinada             31          55    Cloudy
4  05-01-2025      Banglore             32          57     Rainy
5  06-01-2025        Mumbai             33          59     Rainy
6  07-01-2025       Chennai             34          61     Sunny
7  08-01-2025    Rajamundry             32          63    Cloudy
8  09-01-2025         Eluru             31          64     Rainy
9  10-01-2025    Anakapalli             29          62     Sunny

In [3]:
s.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           10 non-null     object
 1   City           10 non-null     object
 2   Temperature_C  10 non-null     int64
 3   Humidity_%     10 non-null     int64
 4   Condition      10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [64]:
s.head()

         Date          City  Temperature_C  Humidity_% Condition
0  01-01-2025      Hyderbad             28          60     Sunny
1  02-01-2025    Vijayawada             29          62     Sunny
2  03-01-2025  Viskhapatnam             30          58    Cloudy
3  04-01-2025      Kakinada             31          55    Cloudy
4  05-01-2025      Banglore             32          57     Rainy

In [65]:
s.tail()

         Date        City  Temperature_C  Humidity_% Condition
5  06-01-2025      Mumbai             33          59     Rainy
6  07-01-2025     Chennai             34          61     Sunny
7  08-01-2025  Rajamundry             32          63    Cloudy
8  09-01-2025       Eluru             31          64     Rainy
9  10-01-2025  Anakapalli             29          62     Sunny

In [66]:
s.head(2)

         Date        City  Temperature_C  Humidity_% Condition
0  01-01-2025    Hyderbad             28          60     Sunny
1  02-01-2025  Vijayawada             29          62     Sunny

In [67]:
s.tail(3)

         Date        City  Temperature_C  Humidity_% Condition
7  08-01-2025  Rajamundry             32          63    Cloudy
8  09-01-2025       Eluru             31          64     Rainy
9  10-01-2025  Anakapalli             29          62     Sunny

In [68]:
s.shape

(10, 5)

In [10]:
s[2:5]

         Date          City  Temperature_C  Humidity_% Condition
2  03-01-2025  Viskhapatnam             30          58    Cloudy
3  04-01-2025      Kakinada             31          55    Cloudy
4  05-01-2025      Banglore             32          57     Rainy

In [11]:
s.columns

Index(['Date', 'City', 'Temperature_C', 'Humidity_%', 'Condition'], dtype='object')

In [13]:
s.index

RangeIndex(start=0, stop=10, step=1)

In [58]:
s.dtypes

name      object
rollno     int64
dtype: object

In [26]:
s.Date

0    01-01-2025
1    02-01-2025
2    03-01-2025
3    04-01-2025
4    05-01-2025
5    06-01-2025
6    07-01-2025
7    08-01-2025
8    09-01-2025
9    10-01-2025
Name: Date, dtype: object

In [69]:
s[["Date","Condition"]]

         Date Condition
0  01-01-2025     Sunny
1  02-01-2025     Sunny
2  03-01-2025    Cloudy
3  04-01-2025    Cloudy
4  05-01-2025     Rainy
5  06-01-2025     Rainy
6  07-01-2025     Sunny
7  08-01-2025    Cloudy
8  09-01-2025     Rainy
9  10-01-2025     Sunny

In [70]:
s["Date"][s["Condition"]=="Sunny"]

0    01-01-2025
1    02-01-2025
6    07-01-2025
9    10-01-2025
Name: Date, dtype: object

In [72]:
import pandas as pd
s=pd.DataFrame({
    "name":["niha","mouni","vedha","pooji"],
    "rollno":[9,3,1,4]
})
s

    name  rollno
0   niha       9
1  mouni       3
2  vedha       1
3  pooji       4

In [73]:
s.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   rollno  4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 196.0+ bytes

In [74]:
s.tail()

    name  rollno
0   niha       9
1  mouni       3
2  vedha       1
3  pooji       4

In [75]:
s.head()

    name  rollno
0   niha       9
1  mouni       3
2  vedha       1
3  pooji       4

In [48]:
s.head(1)

   name  rollno
0  niha       9

In [76]:
s.tail(2)

    name  rollno
2  vedha       1
3  pooji       4

In [77]:
s.columns

Index(['name', 'rollno'], dtype='object')

In [52]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [53]:
s.dtypes

name      object
rollno     int64
dtype: object

In [54]:
s.shape

(4, 2)

In [55]:
s[2:5]

    name  rollno
2  vedha       1
3  pooji       4

In [71]:
s[["name","rollno"]]

KeyError: "None of [Index(['name', 'rollno'], dtype='object')] are in the [columns]"